% ******************************************************************** %
% 该函数根据弹性模量、截面面积、单元长度计算单元的刚度矩阵 %
% 所计算的刚度矩阵为局部坐标系下杆单元的刚度矩阵（6*6） %
% ******************************************************************** %
function k = BEAM2D_Stiffness (E, A, I, x1, y1, x2, y2)
L = sqrt((x2-x1)*(x2-x1)+(y2-y1)*(y2-y1)); %单元长度
C = (x2 - x1)/L; % 余弦
S = (y2 - y1)/L; % 正弦
% 局部坐标系下平面梁单元的刚度矩阵
ke = [E*A/L, 0, 0, -E*A/L, 0, 0;
 0,12*E*I/(L^3), 6*E*I/(L^2), 0, -12*E*I/(L^3), 6*E*I/(L^2);
 0,6*E*I/(L^2), 4*E*I/L, 0, -6*E*I/(L^2), 2*E*I/L;
 -E*A/L, 0, 0, E*A/L, 0, 0;
 0, -12*E*I/(L^3), -6*E*I/(L^2), 0, 12*E*I/(L^3), -6*E*I/(L^2);
 0, 6*E*I/(L^2), 2*E*I/L, 0, -6*E*I/(L^2), 4*E*I/L];
% 坐标变换矩阵
T = [C, S, 0, 0, 0, 0;
 -S, C ,0, 0, 0, 0;
 0 ,0, 1, 0, 0, 0;
 0, 0, 0, C, S, 0;
 0, 0, 0, -S, C, 0;
 0, 0, 0, 0, 0, 1];
k = T'* ke * T;
% 返回杆单元的刚度矩阵