% ****************************************************************************** %
% 输入节点、单元、载荷、约束、材料等信息 %
% 节点信息：包括节点编号（总体坐标系下）及坐标值（Node ID, x, y） %
% 单元信息：单元编号及相关节点编号（Element ID, Node1 ID, Node2 ID） %
% 载荷数据：节点编号及载荷（Node ID, Fx, Fy, Mz），Fx：x方向集中力，Mz:沿z向弯矩 %
% 约束条件：节点编号及约束（Node ID, Cx, Cy, Cz），Cx：x方向位移约束,Cz：转角约束 %
% 弹性模量、惯性矩及截面积：E，I, A等 %
% ****************************************************************************** %
Nodes = [1, 0.0, 0.0; 2, 0.5, 0.3; 3, 0.25, 0.3; 4, 0.0, 0.3]; % 节点信息
Elems = [1, 1, 2; 2, 2, 3; 3, 3,4]; % 单元信息
Loads = [2, 0, -2000, 0; 3, 0, -3000, 0]; % 载荷信息
BCs = [1, 0, 0, 0; 4, 0, 0, NaN]; % 约束条件
E = 70E9; % 材料参数
A = 7.85E-4; % 单元截面积
I = 2.45E-6; % 单元惯性矩
% 计算节点、单元以及整个结构的自由度数量
Node_Dof = 3;
Node_num = size(Nodes,1);
Elem_num = size(Elems,1);
DOFs = Node_Dof * Node_num;
% 明确整体坐标系下结构刚度矩阵、载荷、位移向量的阶数
K = zeros(DOFs, DOFs);
F = zeros(DOFs, 1);
U = zeros(DOFs, 1); 
Ke = zeros(2 * Node_Dof, 2 * Node_Dof);
% *************************************************************************** %
% 计算总体坐标系下单元刚度矩阵并组集成整体刚度矩阵 %
% *************************************************************************** %
for i = 1:Elem_num
 Ke = BEAM2D_Stiffness(E, A, I, Nodes(Elems(i,2),2),Nodes(Elems(i,2),3),...
 Nodes(Elems(i,3),2),Nodes(Elems(i,3),3));
 K = BEAM2D_StiffnessAssembly(K, Ke, Elems(i,2), Elems(i,3));
end
% ********************************************************************** %
% 更新载荷向量 %
% ********************************************************************** %
F = Load_cases (Loads, F, Node_Dof);
% ********************************************************************** %
% 引入约束条件并修正平衡方程 %
% ********************************************************************** %
% 读取约束条件，明确被约束的自由度编号
[Constr_Dof, Constr_Num] = Constrain(BCs, Node_Dof);
% 采用置大数法修正刚度矩阵及载荷向量
[Km, Fm] = modified_equation(K, F, Constr_Num, Constr_Dof);
% 求解节点位移
U = pinv(Km) * Fm;
Node_Force = K*U